[{
	"id": "01256135-8cdb-46a3-a351-bee00a3982d1",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/01256135-8cdb-46a3-a351-bee00a3982d1",
	"created_at": "Fri Apr 19 21:28:36 UTC 2019",
	"company": "Trim",
	"company_url": "https://jobs.lever.co/asktrim",
	"location": "San Francisco",
	"title": "Senior Software Engineer (Full Stack)",
	"description": "\u003cp\u003eTrim is a venture backed fintech startup based in San Francisco. Founded with the mission of making people financially healthy at scale, we have saved our users millions of dollars since our founding 4 years ago, and we have just scratched the surface.\u003c/p\u003e\n\u003cp\u003eWe are looking for a senior full-stack software engineer to lead the development of core features and infrastructure for our product. Engineering is the core of our company. Your work will directly improve the financial health of our users, and will directly affect and be seen by hundreds of thousands of users.\u003c/p\u003e\n\u003cp\u003eThis position is based in San Francisco and reports to the CTO.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat will you do?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Design, build, deploy, and maintain software across the stack from frontend to backend to infrastructure.\u003c/p\u003e\n\u003cp\u003e-Develop, articulate, and prioritize software requirements by working closely with the product, design, growth, and marketing teams.\u003c/p\u003e\n\u003cp\u003e-Use data-driven development and decision making to improve the performance, robustness, and scalability of our systems.\u003c/p\u003e\n\u003cp\u003e-Invest in tools and automation to scale your impact and improve productivity across the whole team.\u003c/p\u003e\n\u003cp\u003e-Teach, mentor and learn from your teammates. Lead and participate in interesting internal tech talks.\u003c/p\u003e\n\u003cp\u003e-Support a culture of code quality, documentation, and thoughtful design tradeoffs. Navigate between shipping quickly and long-term maintainability.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTechnologies we use:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eClient: ES6, React, Redux\nServer: Ruby on Rails, Python\nInfrastructure: PostgreSQL, AWS (RDS, ECS, EC2, RDS, S3, Lambda, and others), Redshift, Convox, Docker, Heroku\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIdeal candidates will have:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-A desire to use their talents to make the world a better place.\u003c/p\u003e\n\u003cp\u003e-5+ years of full time, full-stack web application development experience in client-side JavaScript, along with server-side Ruby, Python, and/or JavaScript.\u003c/p\u003e\n\u003cp\u003e-Working experience in SQL (data modeling, query analysis and optimization).\u003c/p\u003e\n\u003cp\u003e-A deep understanding of the fundamentals of the web.\u003c/p\u003e\n\u003cp\u003e-Prior experience at a high-growth, early-stage company.\u003c/p\u003e\n\u003cp\u003e-A keen eye for product and user experience.\u003c/p\u003e\n\u003cp\u003e-Ability to think critically and independently.\u003c/p\u003e\n\u003cp\u003e-Demonstrable interest in learning and adopting new tools and techniques.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eExperience and understanding in some of the following areas:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Complex single-page applications\u003c/p\u003e\n\u003cp\u003e-AWS architecture\u003c/p\u003e\n\u003cp\u003e-PostgreSQL, Redis\u003c/p\u003e\n\u003cp\u003e-Websockets\u003c/p\u003e\n\u003cp\u003e-Microservices architecture\u003c/p\u003e\n\u003cp\u003e-Non-relational databases\u003c/p\u003e\n\u003cp\u003e-Large-scale data storage and processing\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSome projects you might work on in your first few months:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Lead the full-stack development of a new product that identifies key insights into a consumer’s financial habits and guides them with actionable steps to achieve financial independence.\u003c/p\u003e\n\u003cp\u003e-Build a pub/sub layer to allow the frontend to receive real-time backend data updates without polling.\u003c/p\u003e\n\u003cp\u003e-Create a data model to measure and identify user income from transaction data.\u003c/p\u003e\n\u003cp\u003e-Reduce the size of the React application bundle by enabling code splitting by route.\u003c/p\u003e\n\u003cp\u003e-Migrate terabytes of data stored within PostgreSQL to a separate service with its own data store and distinct scaling characteristics.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy work at Trim?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e-Work with our high-performing, upbeat, and highly-collaborative team.\u003c/p\u003e\n\u003cp\u003e-Move quickly and gain significant ownership over your results.\u003c/p\u003e\n\u003cp\u003e-Commute easily to our office at 14th and Market St. in San Francisco.\u003c/p\u003e\n\u003cp\u003e-Competitive salary and equity compensation.\u003c/p\u003e\n\u003cp\u003e-Full benefits, including top-tier medical, dental, and vision insurance.\u003c/p\u003e\n\u003cp\u003e-Standard start-up perks: catered lunches, delicious snacks, and a variety of succulents.\u003c/p\u003e\n\u003cp\u003eWe are committed to a workplace that reflects the users we serve. We especially encourage women, people of color, and others who are underrepresented in the tech industry to apply.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/asktrim/66699338-76fb-4879-b15d-a78071b69d8f\"\u003ehttps://jobs.lever.co/asktrim/66699338-76fb-4879-b15d-a78071b69d8f\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2hsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ba5b13eb00dfb6566957b576df77e55f58a5ea34/85ddf465-4040-40ba-97cc-7877bbdfcaac-1508621758787.png"
}, {
	"id": "8f939117-206a-4588-90a7-551d6761f724",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/8f939117-206a-4588-90a7-551d6761f724",
	"created_at": "Thu Apr 18 18:25:04 UTC 2019",
	"company": "ShareThis, Inc",
	"company_url": null,
	"location": "Palo Alto, CA, US",
	"title": "Software Engineer - Full Stack",
	"description": "\u003cp\u003eShareThis serves traffic on millions of domains and utilizes the traffic to collect data that powers the business. This data allows us to improve our publishers’ experience and power a growing Advertising business. Our services must remain highly available and our data processing has to keep up with terabytes of data and billions of requests daily. We manage our infrastructure with Kubernetes on Amazon EC2, we build web applications and services with javascript and golang, and we process petabytes of data with Spark and BigQuery.\u003c/p\u003e\n\u003cp\u003eWhat You'll Do\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e     ◦  Build highly responsive production-ready applications using React.\n     ◦  Architect APIs and services with node.js and MongoDB\n     ◦  Work closely with Amazon and Google big-data technologies such as Dynamo and BigQuery\n     ◦  Develop services that will be used by millions of domains\n     ◦  Work closely on both publisher-facing products and ad technology partner products\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eWhat You'll Need:\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e     ◦  B.S. Computer Science (Preferred)\n     ◦  Highly experienced with React.js and/or node.js\n     ◦  Expert knowledge of data structures and their practical applications\n     ◦  Experience with BigQuery, DynamoDB, MongoDB, node.js, and React\n\u003c/code\u003e\u003c/pre\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://jsco.re/2m05h\"\u003ehttps://jsco.re/2m05h\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "deb8f0ea-cf20-44c9-9685-eed254d7b65f",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/deb8f0ea-cf20-44c9-9685-eed254d7b65f",
	"created_at": "Wed Apr 17 22:14:48 UTC 2019",
	"company": "Stride Health",
	"company_url": "http://www.stridehealth.com",
	"location": "San Francisco",
	"title": "Sr. Software Engineer - Front End",
	"description": "\u003cp\u003eAbout the Role--\nStride Health seeks a Sr. Software Engineer to help shape its bright future!  We're a high-energy, tight-knit  team that's empowering consumers to make decisions about their health coverage in a way unparalleled by anyone else. We are committed to hitting bold technological and revenue goals. That's where you come in.\u003c/p\u003e\n\u003cp\u003eResponsibilities--\nYou will be responsible for full stack, hands-on development of applications and services. As a senior member of the team, you will be expected to participate in system design discussions and provide thought leadership in the full development lifecycle from concept to production.\u003c/p\u003e\n\u003cp\u003eQualifications/ Must-Haves --\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e4+ years of professional application development experience and knowledge of what it takes to build and deploy your own application\u003c/li\u003e\n\u003cli\u003eFull-stack software development experience, with a strong focus and background in React, Javascript, Redux, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eExperience building responsive and cross-browser compatible web applications with a strong UI focus\u003c/li\u003e\n\u003cli\u003eGood understanding of responsive web design best practices and web performance optimization techniques\u003c/li\u003e\n\u003cli\u003eProficiency in Python or Node JS for backend development is a HUGE plus\u003c/li\u003e\n\u003cli\u003eBS/BA degree in Computer Science, Software Engineering or other Technical Discipline or equivalent professional experience\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003eAbout Company --\nWe help people who work for themselves save time and money on things like insurance and taxes by providing simple, easy to use software, tools and services. The world’s largest work-for-yourself platforms like Uber, Etsy, Airbnb, Instacart, Postmates, Rover, TaskRabbit, Care.com, and others use Stride to help recruit, retain and motivate their communities of independent workers.\u003c/p\u003e\n\u003cp\u003eWe're located in the heart of San Francisco's South Park district and we’re backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.\u003c/p\u003e\n\u003cp\u003eCome help us take the work out of working for yourself!\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/stridehealth/742254b9-7c20-410e-b616-50f62af46205\"\u003ehttps://jobs.lever.co/stridehealth/742254b9-7c20-410e-b616-50f62af46205\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalZsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cbe898fffefb0fbf5801bda7328b9fa335db3b87/Stride.jpg"
}, {
	"id": "abdcdb4b-8ac3-4072-b3db-7a8d26f000b4",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/abdcdb4b-8ac3-4072-b3db-7a8d26f000b4",
	"created_at": "Wed Apr 17 21:59:00 UTC 2019",
	"company": "Stride Health",
	"company_url": "http://www.stridehealth.com",
	"location": "San Francisco",
	"title": "Android Mobile Developer",
	"description": "\u003cp\u003eAbout the Role:\u003c/p\u003e\n\u003cp\u003eThe Stride team is on the lookout for a smart, motivated individual to help develop new features for our Android app Stride Tax. Your job? Make sure we continue to ship features and scale the app to tens of thousands of users and be an advocate for best practices in Android coding across the company.\u003c/p\u003e\n\u003cp\u003eResponsibilities:\n1)Evolve and expand Android and mobile at Stride\n2)Advance stability, testing, continuous build / integration, and general good practices for Android within the company\n3)Maintain and extend the visual feature set of the Stride Tax app\n4)Collaborate with product managers and designers to implement new features\n5)Work with multiple engineering and non engineering teams within the company on cross-functional efforts\u003c/p\u003e\n\u003cp\u003eQualifications:\n1)Bachelor's Degree in Computer Science (or software engineering related discipline)\n2)A minimum of 2 years of professional experience within the software engineering space (focused on mobile development)\n3)A strong understanding for computer science fundamentals and excitement to work on a fast-paced, collaborative team\n4)Experience programming in Java with ReactiveX\n5)Experience working with RESTful APIs\n6)Experience working with an RDBMS and SQL\n7)Experience managing project builds and dependencies using gradle\n8)Experience developing apps using Android Studio and the core Android SDK\n9)At least one active app on the Play Store\n10)Experience building and maintaining a consumer app with at least 5k daily active users\n11) Above all, you are constantly learning and growing inside and outside of the workplace\u003c/p\u003e\n\u003cp\u003eNice to have:\n1)Experience with the MVP pattern as it pertains to Android\n2)Experience with dependency injection using Dagger2\n3)Experience managing thread and process concerns as related to Android\n4)Experience unit testing with JUnit and UI testing with Espresso\n5)Experience using a continuous integration tool such as Travis CI\n6)A published gradle library\n7)Experience with another front-end technology: web Javascript framework, iOS, etc.\n8)Experience with one or more backend technologies\n9)Experience with API design and architecting network operations\n10)Experience with consumer finance and tax applications, healthcare, or the self-employed/freelancer industry\u003c/p\u003e\n\u003cp\u003eAbout Company:\nWe help people who work for themselves save time and money on things like insurance and taxes by providing simple, easy to use software, tools and services. The world’s largest work-for-yourself platforms like Uber, Etsy, Airbnb, Instacart, Postmates, Rover, TaskRabbit, Care.com, and others use Stride to help recruit, retain and motivate their communities of independent workers.\u003c/p\u003e\n\u003cp\u003eWe're located in the heart of San Francisco's South Park district and we’re backed by leading investment firms including Venrock, New Enterprise Associates, and F-Prime Capital Partners.\u003c/p\u003e\n\u003cp\u003eCome help us take the work out of working for yourself!\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/stridehealth/0f3e97ce-e7c5-469e-99da-960a939c34d0\"\u003ehttps://jobs.lever.co/stridehealth/0f3e97ce-e7c5-469e-99da-960a939c34d0\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTFsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6bd435e5a76c477cc398fe864988bfb618f1bfc1/Stride.jpg"
}, {
	"id": "8c2a2b72-38a2-41f3-985b-6bfb835cffe0",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/8c2a2b72-38a2-41f3-985b-6bfb835cffe0",
	"created_at": "Tue Apr 09 19:05:08 UTC 2019",
	"company": "3Scan",
	"company_url": "http://3Scan",
	"location": "San Francisco",
	"title": "Senior Web Developer, Full Stack",
	"description": "\u003cp\u003eTEAM: Software / Web Team\u003c/p\u003e\n\u003cp\u003eWORKS WITH:  CTO, Software Engineers, Cross Departmentally\u003c/p\u003e\n\u003cp\u003eSTATUS:  Permanent/Exempt\u003c/p\u003e\n\u003cp\u003eSCHEDULE:  40hrs/week\u003c/p\u003e\n\u003cp\u003eTO APPLY:  Interested candidates should submit a single PDF attachment that includes both a cover letter and resume. Send this to \u003ca href=\"mailto:web-team-lead-applicant@3scan.com\"\u003eweb-team-lead-applicant@3scan.com\u003c/a\u003e with subject line: Front End Web Lead Applicant/[your name].\u003c/p\u003e\n\u003cp\u003eDEADLINE:  Open until the position is filled.\u003c/p\u003e\n\u003cp\u003eDIVERSITY: It is very important to our culture and environment; we welcome all applicants.\u003c/p\u003e\n\u003cp\u003eRole Summary\nDevelop web-based tools to drive medical research and decision making using data from 3Scan’s  laboratory automation systems.  Work as part of a small, dynamic team where you can have a large impact.  Projects include: laboratory asset tracking, UIs for robotic automation,  data visualization, and customer-facing data browsers.\u003c/p\u003e\n\u003cp\u003eResponsibilities\nParticipate in the design of 3Scan’s web facing products\nWrite clean, tested, documented, maintainable code\nReview pull requests for other team members\nMaintain and improve our front end build system and development environment\nAdvance our institutional understanding of modern design patterns and technologies\nProvide sprint leadership and technical roadmap construction\u003c/p\u003e\n\u003cp\u003eCore Requirements:\n5+ years experience as a full-stack web engineer\nStrong written and verbal communication skills\nEnjoy cross departmental collaboration\u003c/p\u003e\n\u003cp\u003eExperience in:\nHTML \u0026amp; CSS\nJavaScript (es6+)\nPython or Ruby\nleast one modern front-end framework (React, Angular, Vue.js)\nleast one modern back-end framework (Django, Rails, Spark, Express)\u003c/p\u003e\n\u003cp\u003eBonus Experience:\nTypeScript\nModern front-end devops using Webpack or similar build tools\nAWS\nWebGL, three.js, etc.\nSpark, or another JVM HTTP framework\nTechnical leadership, or management of small teams\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003eInterested candidates should submit a single PDF attachment that includes both a cover letter and resume. Send this to \u003ca href=\"mailto:web-team-lead-applicant@3scan.com\"\u003eweb-team-lead-applicant@3scan.com\u003c/a\u003e with subject line: Front End Web Lead Applicant/[your name].\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2hrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a362ff00b230ea6dbd9896586cd22fd5ba86f286/New%203Scan-logo-mark-only-color.png"
}, {
	"id": "472dd95b-e551-45c9-abc6-a2579d3d6645",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/472dd95b-e551-45c9-abc6-a2579d3d6645",
	"created_at": "Mon Apr 08 21:59:58 UTC 2019",
	"company": "BlueVine",
	"company_url": "https://www.bluevine.com/",
	"location": "Redwood City",
	"title": "Senior Full-Stack Engineer",
	"description": "\u003cp\u003eSmall businesses are the backbone of the American economy, providing innovation, growth, and job opportunities to the communities around them. Many small businesses need funds to run and grow their business, but often don’t get the financial help they need from traditional banks. That’s where BlueVine comes in. BlueVine is a leading provider of small business financing. We’re using cutting edge technology to disrupt the traditional banking industry and develop the next generation of fast and simple financial products, designed for today’s small businesses. BlueVine is headquartered in Redwood City, CA and backed by leading investors including Menlo Ventures, Citi Ventures, SVB Financial, Nationwide Insurance, M12 (Microsoft’s Venture Arm).\u003c/p\u003e\n\u003cp\u003eWe’re building a team of engineers in our Redwood City headquarters to develop a new suite of web and mobile financial products that will drive our next phase of growth. We’re looking for exceptional people to create and deliver these products. If you like engineering challenges and have a strong desire to make a big impact as part of a small, agile team, in an exciting space, we’d love to talk to you. We’re growing quickly, our customers love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe're looking for talented Senior Full-Stack engineers who are flexible enough to develop features from the front (beautiful UX) to the back (scalable and robust components and integrations) for our new line of products. You will work with a talented team of stakeholders and other engineers to design and build our new, strategically important products for BlueVine.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for\u003c/li\u003e\n\u003cli\u003eSF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and build state-of-the-art responsive web \u0026amp; mobile applications\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product managers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe part of a growing, fast-paced, and highly-flexible teamDevelop projects through their entire lifecycle\u003c/li\u003e\n\u003cli\u003eProvide leadership and mentorship to other engineers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of experience building  fast, reliable, web and/or mobile applications\u003c/li\u003e\n\u003cli\u003eWorking knowledge of front-end JavaScript frameworks (e.g., Angular, React, or Vue)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of Python/Django\u003c/li\u003e\n\u003cli\u003eProficiency with database systems (e.g., MySQL PostgreSQL)\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, DevOps and web security\u003c/li\u003e\n\u003cli\u003eExperience with source control management systems, preferably Git\u003c/li\u003e\n\u003cli\u003eB.S. in Computer Science or related field\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eNice To Haves\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience writing unit and integration tests\u003c/li\u003e\n\u003cli\u003eExperience with RESTful APIs\u003c/li\u003e\n\u003c/ul\u003e\n",
	"how_to_apply": "\u003cp\u003eApply today!!\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://jobs.lever.co/bluevine/7ed8eb40-5248-4521-a992-1aecb184612c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/7ed8eb40-5248-4521-a992-1aecb184612c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eor send your resume to: \u003ca href=\"mailto:talent@bluevine.com\"\u003etalent@bluevine.com\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakZrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--57b61a9667324fe17fb302c1c39ebef68905fd14/BV_logo_reverse%201x.jpg"
}, {
	"id": "7e01b588-f51e-496a-8f35-95b9eeb628a5",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/7e01b588-f51e-496a-8f35-95b9eeb628a5",
	"created_at": "Tue Mar 26 04:16:24 UTC 2019",
	"company": "Multi Media",
	"company_url": "http://multimediallc.com",
	"location": "San Francisco or Los Angeles",
	"title": "Director of Front-End Engineering",
	"description": "\u003cp\u003eWe are a technology company that operates a sex-positive video and chat platform that allows a very diverse, worldwide group of independent broadcasters to earn, without middlemen, a very comfortable income from home. Our community has millions of fans, and we rank among the top 100 of all websites.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eApprove all front-end code before it is merged\u003c/li\u003e\n\u003cli\u003eHire and mentor exceptional programmers\u003c/li\u003e\n\u003cli\u003eEstablish and evangelize best practices\u003c/li\u003e\n\u003cli\u003eLead internal programming guild meetings\u003c/li\u003e\n\u003cli\u003eGive feedback on programmers to their direct managers\u003c/li\u003e\n\u003cli\u003eCreate tools that assist programmers, such as docker dev environments, continuous integration tools, internal code documentation, and custom linters\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert understanding of the inner workings of all major browsers, including how they render HTML/CSS and their Javascript runtime environment\u003c/li\u003e\n\u003cli\u003eExperience with architectural patterns and anti-patterns of large, high-scale consumer applications\u003c/li\u003e\n\u003cli\u003eCan distinguish between a “good” and an “exceptional” developer\u003c/li\u003e\n\u003cli\u003eExperience managing software teams of 8+ engineers\u003c/li\u003e\n\u003cli\u003eStrong and proven engineering background\u003c/li\u003e\n\u003c/ul\u003e\n",
	"how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:careers@multimediallc.com\"\u003ecareers@multimediallc.com\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXRpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--92e014f8eb11397a41352fb433e3666971669b65/MULTIM_logo.png"
}, {
	"id": "76fcadae-e84e-11e8-88fc-96a168773892",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/76fcadae-e84e-11e8-88fc-96a168773892",
	"created_at": "Wed Nov 14 20:50:03 UTC 2018",
	"company": "NBCUniversal",
	"company_url": "https://www.nbcunicareers.com/",
	"location": "Universal City, CA",
	"title": "Media Software Engineer",
	"description": "\u003cp\u003eResponsibilities :\u003c/p\u003e\n\u003cp\u003eCoding at the component level and works under minimal supervision.\nAsset Management System Administration with systems, applications and service integrations.\nProvide proactive, regular, and professional-level communication with clients and team members alike\nManage system integration with 3rd party providers.\nProvide usage reports and track key metrics as required.\nEnsure delivered solutions enable the organization to manage the asset portfolio with respect to risk, cost, control, governance, compliance and business performance objectives\nCollaborate with stakeholders, developers, and system teams to design and maintain automation and deployment tools\nAssist project and technology teams in troubleshooting systems\nCreate dashboards and other tools for Project, Operations and Engineering teams to use in day-to-day monitoring and troubleshooting and enhance operational transparency within business units\nFollow Security Best Practices\nOccasional after hour support based on upgrades, new deployments and high-profile campaigns and/or market critical events.\u003c/p\u003e\n\u003cp\u003eJob Requirements\u003c/p\u003e\n\u003cp\u003eKnowledge/experience in relevant technologies, such as:\nXML Scripting\nJava/JavaScript\nJSON Messaging\nHTTP Protocol\nWeb Services (SOAP \u0026amp; REST)\nPython, Ruby, Perl, and Smalltalk or other scripting languages preferred\nFamiliarity with ELK Stack (Prometheus) preferred\nAmazon Web Services technologies experience preferred\nAsset Management Systems\nSolid interpersonal skills with the ability to communicate and present to all levels of the organization and with external parties\nSelf-directed, highly motivated individual who can effectively manage multiple activities, pay attention to detail and a focus on continuous improvement.\nHigh degree of professionalism\u003c/p\u003e\n\u003cp\u003eDesired Characteristics\u003c/p\u003e\n\u003cp\u003eScope of activities within projects include:\nBusiness requirements, documentation \u0026amp; gap analysis\nCoordination of connectivity setup\nTechnical implementation/provisioning\nDevelop test plans, procedures and scripting for new workflows, integration and automated UI testing\nUnderstand Process flow and data mapping\nData preparation, deployment and analysis\nWeb services development\nApplication knowledge: Orchestration tools, Workflow Engines, Search Engines, BPM and transcoding.\nDatabase experience and network administration\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003eIf interested, please apply here: \u003ca href=\"https://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\"\u003ehttps://sjobs.brassring.com/TGWEbHost/jobdetails.aspx?partnerid=25354\u0026amp;siteid=5108\u0026amp;areq=43037BR\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "9999f1f0-e448-11e8-966e-602e38acf303",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303",
	"created_at": "Fri Nov 09 21:36:14 UTC 2018",
	"company": "BlueVine",
	"company_url": "http://bluevine.com",
	"location": "Redwood City, Ca",
	"title": "Senior Python Developer",
	"description": "\u003cp\u003eAt BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.\u003c/p\u003e\n\u003cp\u003eWe’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.\u003c/p\u003e\n\u003cp\u003eAs a \u003cstrong\u003eSenior Python Developer\u003c/strong\u003e at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBENEFITS \u0026amp; PERKS:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eReceive over $1,000 annually for a wellness benefit of your choice\u003c/li\u003e\n\u003cli\u003eFree commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches\u003c/li\u003e\n\u003cli\u003eUnlimited snacks in fully stocked kitchens\u003c/li\u003e\n\u003cli\u003eGenerous PTO and holidays\u003c/li\u003e\n\u003cli\u003eExcellent health coverage and life insurance benefits\u003c/li\u003e\n\u003cli\u003eGenerous, paid parental leave which covers up to 15 weeks\u003c/li\u003e\n\u003cli\u003ePet-friendly offices\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT YOU'LL DO:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eArchitect and build state-of-the-art web \u0026amp; mobile application using a variety of languages and tools\u003c/li\u003e\n\u003cli\u003eBuild distributed backend application in the cloud\u003c/li\u003e\n\u003cli\u003eUnderstand repeatable automated processes for building the application, test it, document it, and deploy it at scale\u003c/li\u003e\n\u003cli\u003eA desire to work as part of a growing, fast-paced, and highly-flexible team\u003c/li\u003e\n\u003cli\u003eWork closely with, and incorporate feedback from, product designers and other stakeholders in the company\u003c/li\u003e\n\u003cli\u003eBe able to develop a project through its entire lifecycle\u003c/li\u003e\n\u003cli\u003eHave strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines\u003c/li\u003e\n\u003cli\u003eProvide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWHAT WE LOOK FOR:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge of Python (4+ years)\u003c/li\u003e\n\u003cli\u003eKnowledge of Django (2+ years)\u003c/li\u003e\n\u003cli\u003eExperience with Celery, RESTful APIs and server-side APIs integration\u003c/li\u003e\n\u003cli\u003eKnowledge of ORM, SQL and Data Modeling\u003c/li\u003e\n\u003cli\u003eExperience with TDD and ability to write quality unit tests\u003c/li\u003e\n\u003cli\u003eExperience with AWS, cloud deployments, devops and web security\u003c/li\u003e\n\u003cli\u003eKnowledge of JavaScript, HTML5, CSS3\u003c/li\u003e\n\u003cli\u003eAbility to quickly learn new technologies and adapt to a fast-paced development environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e[Senior Python Developer] (\u003ca href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e)\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"
}, {
	"id": "24c31152-e440-11e8-9240-8dede5d34cb0",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/24c31152-e440-11e8-9240-8dede5d34cb0",
	"created_at": "Fri Nov 09 16:54:38 UTC 2018",
	"company": "Apple Inc.",
	"company_url": "http://www.apple.com",
	"location": "Cupertino, CA",
	"title": "Full Stack Engineer",
	"description": "\u003cp\u003eDESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.\u003c/p\u003e\n\u003cp\u003eJob Summary:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMarcom is Apple’s Global Marketing Communications group. We lead all of Apple’s advertising and marketing to ensure the flawless development and execution of world class communications.\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://apple.com\"\u003ehttp://apple.com\u003c/a\u003e is a critical part of Apple’s product marketing strategy and a showcase for internet standards and innovation. In the role of Full Stack Engineer, you build the development, testing and content integration pipeline for the platform. We expect you to grow developer productivity, enable continuous deployment, flawless content editing and minimize QA lifecycles.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKey Qualifications:\nStrong JavaScript/Node.js skills, with experience developing web applications and a real passion for learning more.\nYou have an understanding of npm, and experience with publishing modules\nExperience with web packaging tools like browserify, webpack and babel\nYou have capabilities in code quality linters like eslint and knowledge of JavaScript testing frameworks like Jasmine\nYou are proficient in web application security; incorporating security into the software development lifecycle\nYou're familiar with database architecture, scalability and performance and have experience of continuous integration and Jenkins\nYou have Broad UNIX knowledge and skills and are proficient working in bash\nYou have strong verbal and written interpersonal skills\nYou have experience with agile development processes and maintain a philosophy of writing performant, maintainable JavaScript\nYou dream of working in a creative and dynamic environment.\u003c/p\u003e\n\u003cp\u003eDescription:\nCollaborates with other technical teams on DevOps responsibilities for application deployment, performance, monitoring, reliability and scalability\u003c/p\u003e\n\u003cp\u003eManages expectations and provides ongoing status updates to team members.\u003c/p\u003e\n\u003cp\u003eResponsible for critical architectural planning, approaches to content management, integration and serving applications across the development pipeline.\u003c/p\u003e\n\u003cp\u003eUses virtual machines and containerization technologies such as Docker and leads development efforts on large-scale web-based projects,\u003c/p\u003e\n\u003cp\u003eEnsures robust and lasting solutions are selected and embraced.\u003c/p\u003e\n\u003cp\u003eWorks under tight deadlines and keeps producers updated on an ongoing basis.\u003c/p\u003e\n\u003cp\u003eDevelops positive multi-functional relationships and works well with all levels of management.\u003c/p\u003e\n\u003cp\u003eProvides solutions to complex problems in a concise and articulate way.\u003c/p\u003e\n\u003cp\u003eSeen as the 'go to\u003c/p\u003e\n\u003cp\u003eApple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.\u003c/p\u003e\n\u003cp\u003eREQUISITION NUMBER: 113025781\nCOMPANY NAME: Apple Inc.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://ars2.equest.com/?response_id=e0b804211ba9acb4bb3a3848d81de03a\"\u003eApply here\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVZXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c2771689af44c596d7935ae1de19a193ac678333/f470d99d-33e6-44f5-ac37-d1237f0a00d1"
}, {
	"id": "48d5274e-dd45-11e8-8130-eacb3354d656",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/48d5274e-dd45-11e8-8130-eacb3354d656",
	"created_at": "Wed Oct 31 19:45:06 UTC 2018",
	"company": "Traction",
	"company_url": "https://www.tractionco.com/",
	"location": "Sunnyvale, CA ",
	"title": "Lead Full Stack Developer",
	"description": "\u003cp\u003eThe Job:\u003c/p\u003e\n\u003cp\u003eTraction is looking for a Lead Full Stack Developer. You should have prior experience architecting and developing advanced dynamic projects involving technologies for Front-end, Back-end, Database, DevOps and Mobile, as well as leading teams of engineers working on these projects.\u003c/p\u003e\n\u003cp\u003eThis role will see you leading a team of developers as well as being an individual contributor to the team.\u003c/p\u003e\n\u003cp\u003eWe’re on a mission to become one of the most in-demand agencies in the United States, sought out by the best brands in the world to design meaningful experiences for their customers.\u003c/p\u003e\n\u003cp\u003eMust be available to work onsite in Sunnyvale, CA exclusively working embedded with our client that is headquartered in Cupertino.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as the primary technical contact for an engineering team with other teams across disciplines, potentially leading a team of 2-5 developers\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager to ensure requirements and timelines are met\u003c/li\u003e\n\u003cli\u003eWork closely with the development manager and back-end teams to architect and integrate front-end code\u003c/li\u003e\n\u003cli\u003eDevelop advanced applications with a mixture of third-party and proprietary tools and libraries\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eSkills and Experience:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience as a lead developer\u003c/li\u003e\n\u003cli\u003e2+ years of experience building websites using HTML, CSS, and JavaScript\u003c/li\u003e\n\u003cli\u003e8+ years of experience building web applications with any common web technologies (Node.JS, Java, .Net, PHP, Ruby, Python)\u003c/li\u003e\n\u003cli\u003e8+ years of experience with modern web frameworks and/or libraries such as React, Angular, etc.\u003c/li\u003e\n\u003cli\u003e8+ years of experience in modeling n-tier applications\u003c/li\u003e\n\u003cli\u003e6+ years of experience in database modeling; PL/SQL and SQL. MongoDB is a plus\u003c/li\u003e\n\u003cli\u003eExperience writing unit tests for web applications\u003c/li\u003e\n\u003cli\u003eExperience with containers and container platforms (Docker, Mesos, Kubernetes)\u003c/li\u003e\n\u003cli\u003eExperience in defining continuous integration build processes for front-end web development\u003c/li\u003e\n\u003cli\u003eFamiliarity with CI/CD strategy (AWS, Heroku, Google Cloud)/\u003c/li\u003e\n\u003cli\u003eKnowledge of common design patterns in web development (i.e., MVC, MVVM)\u003c/li\u003e\n\u003cli\u003eWorking knowledge of source control software such as Git (preferred) or SVN\u003c/li\u003e\n\u003cli\u003eExposure to Agile project management methodologies\u003c/li\u003e\n\u003cli\u003eAbility to multi-task and manage tasks with varying priorities\u003c/li\u003e\n\u003cli\u003eMust be able to brainstorm and communicate technology ideas and issues with peers and management\u003c/li\u003e\n\u003cli\u003eExcellent verbal and written communication skills\u003c/li\u003e\n\u003cli\u003eExperience in developing applications for Supply Chain business domain, with more focus on Supply Planning, Demand Planning\u003c/li\u003e\n\u003cli\u003eWillingness to learn new technologies and implement in short time\u003c/li\u003e\n\u003cli\u003eComfortable working in a multi-discipline, geographically dispersed team\u003c/li\u003e\n\u003cli\u003eExperience in leading a team of developers through all processes of development and integration, including test automation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation: BA or BS in computer science or equivalent experience\u003c/p\u003e\n\u003cp\u003eExtra Credit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with e-commerce\u003c/li\u003e\n\u003cli\u003eKnowledge of accessibility specifications\u003c/li\u003e\n\u003cli\u003eExperience with GraphQL\u003c/li\u003e\n\u003cli\u003eExperience with Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOur humblebrag:\nJoin an award-winning, digitally-focused, full-service, independent agency staffed by a bunch of folks who love what they do and do what they love. Still on the rise after 17 years of success, you’ll enjoy a satisfying suite of benefits, as well as the chance to work on the world's most well-know brand.\u003c/p\u003e\n\u003cp\u003eWill you accept our mission?\nTraction is dedicated to creating meaningful advertising, branding, and experiences for our clients and their consumers. In order to accomplish this, we have fostered a culture rooted in autonomy, empowerment, collaboration, and—occasionally—mischief. We believe that great work is spontaneous, and the best ideas come from a diverse team of creatively-minded individuals. Our goal is to be an agency where the journey getting there is as great as the work itself, and we’re looking for the right people to help us do it.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\"\u003ehttps://traction.applytojob.com/apply/rpfYAlIVTX/Lead-Full-Stack-Developer\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "f3e305e6-dc66-11e8-8ec9-7dcb52a38c24",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/f3e305e6-dc66-11e8-8ec9-7dcb52a38c24",
	"created_at": "Tue Oct 30 17:13:04 UTC 2018",
	"company": "CommunityVenturePartners",
	"company_url": "https://marinpost.org",
	"location": "Mill Valley",
	"title": "seeking webmaster assistance with frontend and backend.",
	"description": "\u003cp\u003eThe Marin Post (\u003ca href=\"https://marinpost.org\"\u003ehttps://marinpost.org\u003c/a\u003e) seeking webmaster assistance, full-stack coder for frontend and backend coding.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork part time with flexible hours.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork remotely but MUST live in San Francisco Bay Area and be available for occasional face to face meetings in Southern Marin or North San Francisco (Please DO NOT APPLY if you do not live in SF Bay Area).\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePay per experience level. Please provide an accurate resume of experience. Your prior employment will be verified.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eApplicant requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003ePHP, Javascript, HTML, CSS\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eExperience with Craft CMS and Twig or similar Content Management Systems but helpful to have experience with Craft CMS API (plugin) programming (\u003ca href=\"https://craftcms.com/\"\u003ehttps://craftcms.com/\u003c/a\u003e)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eVersed in Git / Github, able to create a pull request.\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n",
	"how_to_apply": "\u003cp\u003eemail resume to: \u003ca href=\"mailto:communityventurepartners@comcast.net\"\u003ecommunityventurepartners@comcast.net\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "ac69c278-d70b-11e8-8d68-56afb6a47cd3",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/ac69c278-d70b-11e8-8d68-56afb6a47cd3",
	"created_at": "Tue Oct 23 21:37:34 UTC 2018",
	"company": "Yardi Systems",
	"company_url": null,
	"location": "Santa Barbara, CA",
	"title": "Web Developer",
	"description": "\u003cp\u003eYardi Systems, the leader in asset and property management software, is currently seeking a Web Developer to join their growing office in Santa Barbara, CA!\u003c/p\u003e\n\u003cp\u003eThe full stack developer must be able to define project specifications, collaborate with stake holders, code complex business logic, implement intuitive user interfaces and otherwise support the corporate marketing websites.\u003c/p\u003e\n\u003cp\u003eResponsibilities\n· Create and maintain WordPress plugins and themes\n· Develop appropriate code structures to solve specific tasks\n· Coordinate/collaborate with staff and teams to develop and deploy projects\n· Assist and support in the upkeep and maintenance of websites\n· Troubleshoot and resolve technical problems\u003c/p\u003e\n\u003cp\u003eRequirements\n· Associate degree, certification or commensurate experience\n· 2+ years of full stack development experience\n· Proficiency with PHP, HTML, CSS, JavaScript/JQuery\n· Experience creating and using APIs and web services (REST/SOAP)\n· An assertive, engaging personality with a history of generating results\n· Goal oriented and able to self-direct\n· Team player who can motivate and encourage the best from others\u003c/p\u003e\n\u003cp\u003ePLEASE APPLY TO: \u003ca href=\"http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\"\u003ehttp://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eYardi Systems is a successful independent software company with a proven history of growth and market leadership in the multi-billion dollar global commercial real estate industry. We employ talented, motivated and innovative people that are focused on delivering superior solutions to our clients and are passionate about working with other highly skilled professionals in team environments.\u003c/p\u003e\n\u003cp\u003eIf you are seeking an opportunity to join a winning team, work with the latest Microsoft technologies and develop your career, then Yardi Systems is the place for you. We have a pleasant and casual work environment, competitive salaries, and a comprehensive benefits package. Our corporate culture stresses integrity, respect, trust, responsibility, and fun.\u003c/p\u003e\n\u003cp\u003eEOE Race/Gender/Disability/Vets\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\"\u003ehttp://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGxYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9fa7253823c51144912b764364fd29d454040a8b/9fac2ffb-e092-4661-8711-4fa829b30ac9"
}]