[{
	"id": "efad4852-ccb8-42ca-abe9-390677d16c63",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/efad4852-ccb8-42ca-abe9-390677d16c63",
	"created_at": "Wed Apr 24 22:01:01 UTC 2019",
	"company": "Kalepa",
	"company_url": "https://kalepainsurance.com",
	"location": "New York",
	"title": "Software Engineer",
	"description": "\u003cp\u003eKalepa is looking for Software Engineers to lead the development of our world-class software for commercial insurers.\u003c/p\u003e\n\u003cp\u003eSoftware engineers at Kalepa will be solving interesting and challenging problems at the intersection of data pipelines, cutting-edge machine learning models, and robust infrastructure. You will be working in a small team building technology from the ground up with the latest stack.\u003c/p\u003e\n\u003cp\u003eKalepa is a New York based, VC backed, startup building software to transform and disrupt commercial insurance.\u003c/p\u003e\n\u003cp\u003eNearly one trillion ($1T) dollars are spent globally each year on commercial insurance across small, medium, and large enterprises. However, the process for estimating the risk associated with a given business across various perils (e.g. fire, injury, malpractice) is still reliant on inefficient and inaccurate manual forms or outdated and sparse databases. This information asymmetry leads to a broken set of economic incentives and a poor experience for both businesses and insurers alike. By combining cutting edge data science, enterprise software, and insurance expertise, Kalepa will turn real-world data into a complete understanding of risk – leading to more profitable, efficient, and applicant-friendly insurance underwriting. There are many challenging problems to solve in the insurance industry and a massive opportunity to operate it more profitably and effectively.\u003c/p\u003e\n\u003cp\u003eKalepa is led by a strong team with experiences from Facebook, APT (acquired by Mastercard for $600M in 2015), the Israel Defense Forces, MIT, Berkeley, and UPenn.\u003c/p\u003e\n\u003cp\u003eAbout you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou enjoy understanding customer business needs and translating them into specifications or code\u003c/li\u003e\n\u003cli\u003eYou are excited about using a wide set of technologies, ultimately focused on finding the right tool for the job\u003c/li\u003e\n\u003cli\u003eYou are energized by automating the collection, parsing, reconciliation, and storage of huge volumes of disparate data from a variety of sources\u003c/li\u003e\n\u003cli\u003eYou want to design a flexible analytics, data science, and AI framework to transform the insurance industry\u003c/li\u003e\n\u003cli\u003eYou value open, frank, and respectful communication\u003c/li\u003e\n\u003cli\u003eYou are a proactive and collaborative problem solver with a “can do” attitude\u003c/li\u003e\n\u003cli\u003eYou have in-depth knowledge of Python, SQL and no-SQL databases, and hands-on experience with Python server-side frameworks\u003c/li\u003e\n\u003cli\u003eYou have hands-on experience with data analytics and data engineering\u003c/li\u003e\n\u003cli\u003eYou have experience with AWS infrastructure\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAs a plus:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have hands-on experience with machine learning algorithms, NLP, and image recognition\u003c/li\u003e\n\u003cli\u003eYou have familiarity with Spark, Hadoop, and OLAP tools\u003c/li\u003e\n\u003cli\u003eYou have knowledge of Go and Scala\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you’ll get\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork with an ambitious, smart, and fun team to transform a $1T global industry\u003c/li\u003e\n\u003cli\u003eGround floor opportunity – opportunity to build the foundations for the product, team, and culture alongside the founding team\u003c/li\u003e\n\u003cli\u003eWide-ranging intellectual challenges spanning full-stack software development, AI / ML, and strong design\u003c/li\u003e\n\u003cli\u003eCompetitive compensation package with a significant equity component\u003c/li\u003e\n\u003c/ul\u003e\n",
	"how_to_apply": "\u003cp\u003eEmail your resume to \u003ca href=\"mailto:paul.monasterio@kalepa.co\"\u003epaul.monasterio@kalepa.co\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWhsIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fecb5f19df776f941b2e3305e37dbfb8bf0834a4/Kalepa%20Logo%20No%20Bg.png"
}, {
	"id": "6d2e991c-8a9f-4c2e-891a-418077614bd0",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/6d2e991c-8a9f-4c2e-891a-418077614bd0",
	"created_at": "Thu Apr 11 21:47:23 UTC 2019",
	"company": "Simons Foundation",
	"company_url": "http:",
	"location": "New York, NY, USA, 10001",
	"title": "Web Developer",
	"description": "\u003cp\u003ePOSITION SUMMARY\u003c/p\u003e\n\u003cp\u003eThis role will support the maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation's support of basic and applied research.\u003c/p\u003e\n\u003cp\u003eESSENTIAL FUNCTIONS/RESPONSIBILITIES\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupport back-end and front-end web development for a diverse collection of foundation-affiliated websites, many built on WordPress\u003c/li\u003e\n\u003cli\u003eWork collaboratively and closely with editors, front-end designers, web producers and other developers\u003c/li\u003e\n\u003cli\u003eEffectively manage priorities for multiple concurrent projects\u003c/li\u003e\n\u003cli\u003eCommunicate with stakeholders to gather requirements and ensure their needs are being met\u003c/li\u003e\n\u003cli\u003eAdapt to changing requirements\u003c/li\u003e\n\u003cli\u003ePerform any other duties or tasks as assigned or required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eMINIMUM QUALIFICATIONS\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA bachelor's degree is required\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProficient with WordPress, with 3+ years of experience developing custom WP sites\u003c/li\u003e\n\u003cli\u003eAdvanced expertise with PHP and MySQL\u003c/li\u003e\n\u003cli\u003eDeep understanding of HTML and CSS\u003c/li\u003e\n\u003cli\u003eExperience with JavaScript and jQuery\u003c/li\u003e\n\u003cli\u003eExperience with React or similar JS libraries or frameworks\u003c/li\u003e\n\u003cli\u003eExperience with responsive web development\u003c/li\u003e\n\u003cli\u003eExcellent communication skills\u003c/li\u003e\n\u003cli\u003eProficient with version control tools, such as Git and SVN.\u003c/li\u003e\n\u003cli\u003ePortfolio of work products that function well on multiple device types\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesirable\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBackground in User Experience and User Interface design\u003c/li\u003e\n\u003cli\u003eExperience with Python and Django\u003c/li\u003e\n\u003cli\u003eExperience with responsive web design, integration and usability testing\u003c/li\u003e\n\u003cli\u003eExperience with high-volume websites and/ or journalistic websites\u003c/li\u003e\n\u003cli\u003eComfort with Adobe Creative Cloud\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eTHE SIMONS FOUNDATION'S DIVERSITY COMMITMENT\u003c/p\u003e\n\u003cp\u003eMany of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law.\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/gvsr5g9n7nrk8yyx\"\u003ehttp://www.Click2apply.net/gvsr5g9n7nrk8yyx\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI109186638\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003eApply Here:\u003ca href=\"http://www.Click2apply.net/gvsr5g9n7nrk8yyx\"\u003ehttp://www.Click2apply.net/gvsr5g9n7nrk8yyx\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "e71b76e4-d940-496b-9589-a356409712a8",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/e71b76e4-d940-496b-9589-a356409712a8",
	"created_at": "Thu Mar 28 14:57:49 UTC 2019",
	"company": "Quartz",
	"company_url": "http://qz.com",
	"location": "New York, NY",
	"title": "Backend Engineer",
	"description": "\u003cp\u003eQuartz is an ambitious and fast-growing global business news brand. Our mission is to create high-quality global business journalism that thrives in the digital age. This is a serious opportunity to redefine the news reading experience, and you will work on a large number of fun and challenging problems as the site and team grow.\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003eProfessional experience building backend application of high-traffic website with Java (and Kotlin). It is okay to have different language experience like Go, Scala, Python or Node.js but you should be comfortable to learn Java/JVM deeply.\u003c/p\u003e\n\u003cp\u003eSpring framework, Jersey and Hibernate make up a large portion of our technology stack. You should have significant experience with at least one of them.\u003c/p\u003e\n\u003cp\u003eThe ability to develop simple, elegant solutions—with an eye for maintainability—is paramount.\nAbility to use Git(hub) is essential. You should be comfortable branching, merging, creating pull requests, and reviewing the code of your peers.\u003c/p\u003e\n\u003cp\u003eWe practice Agile development, and you should feel comfortable working this way.\u003c/p\u003e\n\u003cp\u003eWritten and verbal communication skills are a must. You should be able to communicate with both technical and non-technical colleagues. Experience writing documentation is a plus.\u003c/p\u003e\n\u003cp\u003eOur team solves problems together, with creativity and collaboration. You should feel comfortable asking for help when you're stuck and listen with compassion when your fellow colleagues ask the same of you.\u003c/p\u003e\n\u003cp\u003eWe adopt new technologies carefully, with an eye for stability and reliability. Tested code is the best code.\u003c/p\u003e\n\u003cp\u003eNice to have:\u003c/p\u003e\n\u003cp\u003eExperience with CI/CD of backend app and integrating it into a team’s workflow.\u003c/p\u003e\n\u003cp\u003eExperience with AWS, Docker and middlewares such as nginx.\u003c/p\u003e\n\u003cp\u003eExperience with website development with Sass and Javascript framework such as React, Angular or Vue.\u003c/p\u003e\n\u003cp\u003eEnterprise Values\u003c/p\u003e\n\u003cp\u003eQuartz recruits talent for two salient attributes or qualities:\u003c/p\u003e\n\u003cp\u003eForce of Ideas: At the center of Quartz work are the ideas within our writing.  We believe that ideas – to the good and not – have consequence. Our highest work is bringing rigor, insight, intellectual honesty, to that ultimate purpose of separating the bad from the good, and giving voice to the latter.\nSpirit of Generosity: Quartz seeks in its ranks a spirit of generosity – a natural disposition in each colleague toward service and selfless conduct.  Quartz writing should be cut from the same cloth – critical on the merits but informed by charity and forbearance in measuring motive and personal character.\nQuartz Media LLC is an EOE of Minorities/Women/Vets/Disability.\u003c/p\u003e\n\u003cp\u003ePursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003ePlease apply here: \u003ca href=\"https://atlanticmedia.applytojob.com/apply/PBsohrgcbX/Backend-Engineer\"\u003ehttps://atlanticmedia.applytojob.com/apply/PBsohrgcbX/Backend-Engineer\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBalJqIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--da2e3ba7ace0b115f83056536754aa917d5e8721/quartz-Logo.png"
}, {
	"id": "9e1850ce-9c91-4080-9737-1cf7507bfbdd",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/9e1850ce-9c91-4080-9737-1cf7507bfbdd",
	"created_at": "Tue Mar 26 18:51:52 UTC 2019",
	"company": "Vibrant Emotional Health",
	"company_url": "http://www.vibrant.org",
	"location": "NewYork, NY",
	"title": "Software Engineer - Full Stack Developer",
	"description": "\u003cp\u003eSoftware Engineer - Full Stack Developer\u003c/p\u003e\n\u003cp\u003eFormerly the Mental Health Association of New York City (MHA-NYC), Vibrant Emotional Health’s groundbreaking solutions have delivered high quality services and support, when, where and how people need it for over 50 years. Through our state-of-the-art technology-enabled services, community wellness programs, and advocacy and education work, we are building a society in which emotional wellness can be a reality for everyone.\u003c/p\u003e\n\u003cp\u003eDepartment - Information Technology\u003c/p\u003e\n\u003cp\u003ePosition Summary:\nWe’re looking for a software developer ready to help save lives and change lives by applying cutting edge technology to mental health and wellness. Every day, thousands of kids, veterans, families, and New York residents of all sorts reach out to us for help by phone, chat, and text message. Our trained counselors help them and connect them to health resources.\u003c/p\u003e\n\u003cp\u003eAs part of a software engineering team at Vibrant, under the supervision of the Lead Architect, you will assist in designing, developing, and implementing software applications with an emphasis on rich client web-based applications and data driven reporting. You will maintain and improve existing systems in collaboration with the development team; participate in planning and implementing upgrades and new software installations; perform research, testing, and evaluation of potential new systems; write technical specifications and documentation; perform other related duties as requested.\u003c/p\u003e\n\u003cp\u003eEssential Duties and Responsibilities:\nAssists in designing, developing and implementing complex software applications with an emphasis on rich client web-based applications and analytics under close supervision of the Lead Architect.\nIn collaboration with the Lead Programmer, maintains and improves upon existing systems, infrastructure and software.\nParticipates in planning and implementing upgrades and new software installations.\nIn collaboration with the Lead Programmer and other Project Managers, performs research, testing, and evaluation of potential new systems and software under the guidance of the Lead Programmer.\nWrites technical specifications and documentation.\nPerforms other duties as assigned.\u003c/p\u003e\n\u003cp\u003eMinimum Qualifications:\nBachelor's degree and 2-4 years of related experience (or equivalent combination of education and experience).\nGet things done! Your architecture and design choices are sound, even inspired, but you understand that software development is a team sport, and that delivering value to end users, quickly and often is key to evolving useful software solutions.\nExcited by the prospect of transforming software dev at a smart mission-focused organization.\nComfortable developing web applications on both Windows dotNet/IIS and Linux.\nIs proficient with one or more programming languages, including dotNet (C#), and dynamic languages such as Python or Ruby.\nHave worked with CI tools, Github, and deployment tooling.\nHave experience with data-wrangling, SQL, and various database systems.\u003c/p\u003e\n\u003cp\u003eVibrant Emotional Health is an equal opportunity employer. Applicants are considered for positions without regard to veteran status, uniformed service member status, race, creed, color, religion, gender, gender identity, sex, sexual orientation, citizenship status, national origin, marital status, age, physical or mental disability, genetic information, caregiver status or any other category protected by applicable federal, state or local laws.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003evibrant.org/work4us\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
	"created_at": "Mon Nov 19 15:44:44 UTC 2018",
	"company": "Aon Cyber Solutions",
	"company_url": "http://www.strozfriedberg.com/careers",
	"location": "NY or LA",
	"title": "Cybersecurity Firm Seeks Senior Developer",
	"description": "\u003cp\u003eAon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.\u003c/p\u003e\n\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePosition Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.\u003c/p\u003e\n\u003cp\u003eThe responsibilities of this position include but are not limited to the following:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.\u003c/li\u003e\n\u003cli\u003eServe as a senior developer on multiple product teams.\u003c/li\u003e\n\u003cli\u003eCreate user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.\u003c/li\u003e\n\u003cli\u003eTranslate high-level requirements into working prototypes to generate user feedback and discussion.\u003c/li\u003e\n\u003cli\u003eAdapt and apply cutting edge computer science to highly technical domains.\u003c/li\u003e\n\u003cli\u003eParticipate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.\u003c/li\u003e\n\u003cli\u003eMentor other developers.\u003c/li\u003e\n\u003cli\u003eContribute to a positive, collaborative culture for innovation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eRequirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of software engineer experience.\u003c/li\u003e\n\u003cli\u003eProficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of HTTP and REST web services implementation.\u003c/li\u003e\n\u003cli\u003eTest driven development and unit testing frameworks.\u003c/li\u003e\n\u003cli\u003eModern DevOps experience.\u003c/li\u003e\n\u003cli\u003eStandard software engineering tools (git, Jenkins, JIRA).\u003c/li\u003e\n\u003cli\u003eThe proven ability to see things as they should be, and to realize that vision.\u003c/li\u003e\n\u003cli\u003eComfort with agile development and remote team environments.\u003c/li\u003e\n\u003cli\u003eExcellence in verbal and written communication.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDesired Skills\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTypeScript\u003c/li\u003e\n\u003cli\u003ePython 3 and web frameworks such as Django or Flask.\u003c/li\u003e\n\u003cli\u003eSQL \u0026amp; relational database modeling.\u003c/li\u003e\n\u003cli\u003eExperience in deployment to AWS, especially serverless technologies.\u003c/li\u003e\n\u003cli\u003eStrong knowledge of JWT and various web security models.\u003c/li\u003e\n\u003cli\u003eD3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).\u003c/li\u003e\n\u003cli\u003eElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.\u003c/li\u003e\n\u003cli\u003eJava 8 and other JVM-based languages.\u003c/li\u003e\n\u003cli\u003ePerformance monitoring and optimization.\u003c/li\u003e\n\u003cli\u003eMobile development using Native or Cross-platform (Xamarin, Ionic, React Native).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEducation Required\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.\u003c/li\u003e\n\u003c/ul\u003e\n",
	"how_to_apply": "\u003cp\u003eAPPLY HERE: \u003ca href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\"\u003ehttps://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}, {
	"id": "4cd29974-e48b-11e8-8478-fb9810f86b79",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/4cd29974-e48b-11e8-8478-fb9810f86b79",
	"created_at": "Sat Nov 10 02:02:55 UTC 2018",
	"company": "Sesame",
	"company_url": "http://sesamecare.com",
	"location": "New York; Berlin",
	"title": "Software engineer (back end)",
	"description": "\u003cp\u003eWe’re Sesame and we’re building a transformative health care platform that makes it easier and more affordable for all Americans to access high-quality health care.\u003c/p\u003e\n\u003cp\u003eOur all-star team is primed for the journey of re-shaping American health care to put people like you and your family first. Unaffordable health care that’s hard to navigate is what keeps us up at night.\u003c/p\u003e\n\u003cp\u003eWe believe everyone should be able to get high-quality care for a fair price. That’s why we’re working with doctors who share our vision for giving people a better way to get the care they need without the stress, frustrations, and rip-offs of the current health care system.\u003c/p\u003e\n\u003cp\u003eWe’re passionate about building a new kind of health care economy that works for everyday people, and this is just the beginning.\u003c/p\u003e\n\u003cp\u003eWe must be on to something, since we’re proud to say:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe have engineering teams in New York and Berlin\u003c/li\u003e\n\u003cli\u003eWe've raised millions in funding to grow U.S. operations.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWant to help? Join our team. We are a small group of engineers, but we’re growing and looking for experienced back end engineers with a focus on Java to expand our ranks here in New York and Berlin.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout you:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eComfortable with Java and microservices.\u003c/li\u003e\n\u003cli\u003eYou seek and prefer simple solutions to complex problems.\u003c/li\u003e\n\u003cli\u003eYou strive to write clean, quality code and enjoy doing it.\u003c/li\u003e\n\u003cli\u003eYou maintain a healthy balance between perfectionism and actually getting stuff done.\u003c/li\u003e\n\u003cli\u003eYou either have experience with the technologies we currently use (or a strong interest in them) and the curiosity to learn new languages and frameworks.\u003c/li\u003e\n\u003cli\u003eYou love developing software. You have 2+ years of industry experience.\u003c/li\u003e\n\u003cli\u003eYou are a strong team player, have strong writing skills, and enjoy collaborating with others.\u003c/li\u003e\n\u003cli\u003eYou are attuned to the fundamentals of user design and user experience.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur technology stack includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eJava 10\u003c/li\u003e\n\u003cli\u003eSpring Boot\u003c/li\u003e\n\u003cli\u003eKubernetes\u003c/li\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePub/Sub\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003cli\u003eNodeJs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur Offer:\u003c/strong\u003e\nWorking with us means you will be challenged every day by our customers, our partners, and your peers. You can be yourself, speak freely, be trusted and respected.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePerks:\u003c/strong\u003e\nCompetitive total compensation package with generous equity.\nGenerous, flexible vacation policy.\nA fun and international work environment with teams in New York and Europe.\nThe opportunity to work independently and occasionally remotely.\nThe chance to learn first-hand about the biggest industry in the world.\u003c/p\u003e\n\u003cp\u003eSesame is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003e\u003ca href=\"https://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/sesamecare/26d259b5-5bcc-4ee9-a5d0-068d9c856381?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWRXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bfdeee729a4dbb9e1851c0362a1cf73bf3b6c646/03acb87e-f369-4964-950b-80043ff18ae1"
}, {
	"id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
	"type": "Full Time",
	"url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
	"created_at": "Fri Nov 09 14:51:11 UTC 2018",
	"company": "New York University",
	"company_url": null,
	"location": "New York, New York 10001",
	"title": "Technology Solutions Developer",
	"description": "\u003cp\u003eAs a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.\u003c/p\u003e\n\u003cp\u003eUS\u003c/p\u003e\n\u003cp\u003eThe Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.\u003c/p\u003e\n\u003cp\u003eOur group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.\u003c/p\u003e\n\u003cp\u003eYOU\u003c/p\u003e\n\u003cp\u003eWe're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!\u003c/p\u003e\n\u003cp\u003eWHY\u003c/p\u003e\n\u003cp\u003eAs an employee of NYU Law, you would receive NYU's benefits (\u003ca href=\"https://www.nyu.edu/employees/benefit.html\"\u003ehttps://www.nyu.edu/employees/benefit.html\u003c/a\u003e), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.\u003c/p\u003e\n\u003cp\u003eRequired Education:\nBachelor's degree.\u003c/p\u003e\n\u003cp\u003eRequired Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.\u003c/p\u003e\n\u003cp\u003ePreferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.\u003c/p\u003e\n\u003cp\u003eRequired Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.\u003c/p\u003e\n\u003cp\u003ePreferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)\u003c/p\u003e\n\u003cp\u003eEOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI105491972\u003c/p\u003e\n",
	"how_to_apply": "\u003cp\u003eApply Here: \u003ca href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\"\u003ehttp://www.Click2apply.net/cyg9sy9m99zdm9v2\u003c/a\u003e\u003c/p\u003e\n",
	"company_logo": null
}]